{
  "architectures": [
    "VideoMAEForVideoClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 384,
  "decoder_intermediate_size": 1536,
  "decoder_num_attention_heads": 6,
  "decoder_num_hidden_layers": 4,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Ball_out_of_play",
    "1": "Corner",
    "10": "Shots_on_target",
    "11": "Yellow_card",
    "12": "Yellow_red_card",
    "2": "Direct_free-kick",
    "3": "Foul",
    "4": "Goal",
    "5": "Indirect_free-kick",
    "6": "Offside",
    "7": "Penalty",
    "8": "Red_card",
    "9": "Shots_off_target"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Ball_out_of_play": 0,
    "Corner": 1,
    "Direct_free-kick": 2,
    "Foul": 3,
    "Goal": 4,
    "Indirect_free-kick": 5,
    "Offside": 6,
    "Penalty": 7,
    "Red_card": 8,
    "Shots_off_target": 9,
    "Shots_on_target": 10,
    "Yellow_card": 11,
    "Yellow_red_card": 12
  },
  "layer_norm_eps": 1e-12,
  "model_type": "videomae",
  "norm_pix_loss": false,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "5.10.2",
  "tubelet_size": 2,
  "use_mean_pooling": true
}
